app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    @post.username = current_user.username

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "updated_at", "body", "user_id", "username") VALUES (?, ?, ?, ?, ?)

  def destroy
    @post = Post.destroy(params[:id])
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 7]]